{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Loading Data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "from rdflib import ConjunctiveGraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Loaded 3088 triples\n"
     ]
    }
   ],
   "source": [
    "kg = ConjunctiveGraph()\n",
    "kg.parse(\"ebaii.ttl\")\n",
    "print(f\"Loaded {len(kg)} triples\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "https://academic.oup.com/bioinformatics/article/25/14/1754/225615 has type http://schema.org/ScholarlyArticle\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b160 has type http://schema.org/ScholarlyArticle\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b210 has type http://schema.org/ScholarlyArticle\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b294 has type http://schema.org/ScholarlyArticle\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b326 has type http://schema.org/ScholarlyArticle\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b1 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b2 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b39 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b40 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b41 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b42 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b43 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b44 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b45 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b46 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b47 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b48 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b51 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b52 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b53 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b54 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b57 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b58 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b59 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b60 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b61 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b62 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b63 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b64 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b65 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b66 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b67 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b68 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b69 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b70 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b71 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b72 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b73 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b74 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b75 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b76 has type http://schema.org/Person\n",
      "https://www.france-bioinformatique.fr/#/schema/Person/cbd110e3f7b4c1922b979c06f5b3e048 has type http://schema.org/Person\n",
      "https://www.france-bioinformatique.fr/#/schema/Person/768e8b89d67f82453ce3e064b1dbaec8 has type http://schema.org/Person\n",
      "https://bioschemas.org/people/AlasdairGray has type http://schema.org/Person\n",
      "https://bioschemas.org/people/AlbanGaignard has type http://schema.org/Person\n",
      "https://bioschemas.org/people/LeylaGarcia has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b87 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b88 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b89 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b90 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b127 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b128 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b143 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b144 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b161 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b164 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b171 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b180 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b182 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b184 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b186 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b188 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b211 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b218 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b229 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b230 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b236 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b238 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b240 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b242 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b244 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b246 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b248 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b263 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b265 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b267 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b269 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b271 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b273 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b275 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b295 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b302 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b317 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b318 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b327 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b330 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b333 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b347 has type http://schema.org/Person\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b349 has type http://schema.org/Person\n",
      "https://bio.tools/bowtie2 has type http://schema.org/SoftwareApplication\n",
      "https://bio.tools/bwa has type http://schema.org/SoftwareApplication\n",
      "https://bio.tools/deseq2 has type http://schema.org/SoftwareApplication\n",
      "https://bio.tools/fastqc has type http://schema.org/SoftwareApplication\n",
      "https://bio.tools/homer has type http://schema.org/SoftwareApplication\n",
      "https://bio.tools/macs has type http://schema.org/SoftwareApplication\n",
      "https://bio.tools/rsat has type http://schema.org/SoftwareApplication\n",
      "https://tess.elixir-europe.org/events/11eme-ecole-de-bioinformatique-aviesan-ifb-inserm has type http://schema.org/Course\n",
      "https://tess.elixir-europe.org/events/12eme-ecole-de-bioinformatique-aviesan-ifb-inserm-ebaii-2023 has type http://schema.org/Course\n",
      "https://tess.elixir-europe.org/events/mooc-single-cell-rna-seq-data-analysis-using-chipster has type http://schema.org/Course\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b231 has type http://schema.org/Course\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b286 has type http://schema.org/Course\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b323 has type http://schema.org/Course\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b324 has type http://schema.org/Course\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b3 has type http://schema.org/CourseInstance\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b6 has type http://schema.org/CourseInstance\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b13 has type http://schema.org/CourseInstance\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b19 has type http://schema.org/CourseInstance\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b33 has type http://schema.org/CourseInstance\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b36 has type http://schema.org/CourseInstance\n",
      "https://www.sib.swiss/training/course/20230426_DOCK has type http://schema.org/CourseInstance\n",
      "https://www.sib.swiss/training/course/20240527_DOCK has type http://schema.org/CourseInstance\n",
      "https://bioschemas.org/profiles/CourseInstance/1.0-RELEASE has type http://schema.org/CourseInstance\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b232 has type http://schema.org/CourseInstance\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b287 has type http://schema.org/CourseInstance\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b4 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b7 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b9 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b10 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b17 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b23 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b34 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b37 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b130 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b132 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b146 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b148 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b163 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b166 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b168 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b170 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b173 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b213 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b215 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b217 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b220 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b222 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b297 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b299 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b301 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b304 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b306 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b329 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b332 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b335 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b337 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b339 has type http://schema.org/PostalAddress\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b5 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b8 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b14 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b15 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b16 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b18 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b20 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b21 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b22 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b24 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b25 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b26 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b27 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b28 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b29 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b30 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b31 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b32 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b35 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b38 has type http://schema.org/Organization\n",
      "https://www.france-bioinformatique.fr/#/schema/Organization has type http://schema.org/Organization\n",
      "https://ror.org/002n09z45 has type http://schema.org/Organization\n",
      "https://bioschemas.org/profiles/Organization/0.2-DRAFT-2019_07_19 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b162 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b165 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b167 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b169 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b172 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b175 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b181 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b183 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b185 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b187 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b189 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b192 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b194 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b196 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b198 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b200 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b201 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b206 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b207 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b208 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b212 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b214 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b216 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b219 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b221 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b225 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b237 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b239 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b241 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b243 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b245 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b247 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b249 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b251 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b254 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b255 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b256 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b258 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b264 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b266 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b268 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b270 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b272 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b274 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b276 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b278 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b281 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b282 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b283 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b290 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b296 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b298 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b300 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b303 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b305 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b309 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b328 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b331 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b334 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b336 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b338 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b341 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b348 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b350 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b353 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b354 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b360 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b361 has type http://schema.org/Organization\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b362 has type http://schema.org/Organization\n",
      "https://tess.elixir-europe.org/events/12eme-ecole-de-bioinformatique-aviesan-ifb-inserm has type http://schema.org/Event\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b125 has type http://schema.org/Event\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b126 has type http://schema.org/Event\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b141 has type http://schema.org/Event\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b142 has type http://schema.org/Event\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b11 has type http://schema.org/Audience\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b12 has type http://schema.org/Audience\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b49 has type http://schema.org/Audience\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b50 has type http://schema.org/Audience\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b55 has type http://schema.org/Audience\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b56 has type http://schema.org/Audience\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b228 has type http://schema.org/Audience\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b316 has type http://schema.org/Audience\n",
      "https://tess.elixir-europe.org/materials/chip-seq-data-analysis-identification-of-the-binding-sites-of-the-estrogen-receptor has type http://schema.org/LearningResource\n",
      "https://tess.elixir-europe.org/materials/hands-on-for-assembly-of-metagenomic-sequencing-data-tutorial has type http://schema.org/LearningResource\n",
      "https://tess.elixir-europe.org/materials/hands-on-for-exome-sequencing-data-analysis-for-diagnosing-a-genetic-disease-tutorial has type http://schema.org/LearningResource\n",
      "https://dx.doi.org/10.4126/FRL01-006432243 has type http://schema.org/LearningResource\n",
      "https://sib-swiss.github.io/containers-introduction-training/latest/ has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b83 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b84 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b85 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b86 has type http://schema.org/LearningResource\n",
      "https://bioschemas.org/profiles/TrainingMaterial/1.0-RELEASE has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b177 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b191 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b193 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b195 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b197 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b199 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b227 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b233 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b260 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b315 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b344 has type http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b352 has type http://schema.org/LearningResource\n",
      "http://edamontology.org/topic_3173 has type http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3697 has type http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_0089 has type http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_0199 has type http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3063 has type http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3170 has type http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3673 has type http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_0622 has type http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3168 has type http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3169 has type http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3174 has type http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_0091 has type http://schema.org/DefinedTerm\n",
      "http://orcid.org/0000-0003-4874-2874 has type schema:Person\n",
      "https://academic.oup.com/bioinformatics/bioinformatics has type http://schema.org/Periodical\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b174 has type http://schema.org/Periodical\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b224 has type http://schema.org/Periodical\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b308 has type http://schema.org/Periodical\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b340 has type http://schema.org/Periodical\n",
      "https://academic.oup.com/bioinformatics/bioinformatics/issue/25/14 has type http://schema.org/PublicationIssue\n",
      "https://bigcat-um.github.io/BiGCaT-Teaching/Lectures/Bioinformatics%20Lectures/2013_Epigenetics-Chris_Evelo.pdf has type http://schema.org/CreativeWork\n",
      "https://bigcat-um.github.io/BiGCaT-Teaching/Lectures/Bioinformatics%20Lectures/2013_Genetic%20variation_BWE.pdf has type http://schema.org/CreativeWork\n",
      "https://bioschemas.org/profiles/Event/0.2-DRAFT-2019_06_14 has type http://schema.org/CreativeWork\n",
      "https://doi.org/10.1093/bioinformatics/btp324 has type http://schema.org/CreativeWork\n",
      "https://doi.org/10.1093/bioinformatics/btp698 has type http://schema.org/CreativeWork\n",
      "https://bioschemas.org/profiles/Course/0.9-DRAFT-2020_12_08 has type http://schema.org/CreativeWork\n",
      "https://bioschemas.org/profiles/CourseInstance/0.8-DRAFT-2020_10_06 has type http://schema.org/CreativeWork\n",
      "https://doi.org/10.1016/j.ygeno.2017.03.001 has type http://schema.org/CreativeWork\n",
      "https://doi.org/10.1093/bioinformatics/btu146 has type http://schema.org/CreativeWork\n",
      "https://doi.org/10.1186/1471-2105-14-184 has type http://schema.org/CreativeWork\n",
      "https://doi.org/10.1186/1471-2164-15-264 has type http://schema.org/CreativeWork\n",
      "https://doi.org/10.7490/f1000research.1114334.1 has type http://schema.org/CreativeWork\n",
      "https://doi.org/10.1038/nmeth.1923 has type http://schema.org/CreativeWork\n",
      "https://doi.org/10.1186/s13059-014-0550-8 has type http://schema.org/CreativeWork\n",
      "https://bioschemas.org/profiles/Course/1.0-RELEASE has type http://schema.org/CreativeWork\n",
      "https://bioschemas.org/profiles/CourseInstance/1.0-RELEASE has type http://schema.org/CreativeWork\n",
      "https://bioschemas.org/profiles/TrainingMaterial/1.0-RELEASE has type http://schema.org/CreativeWork\n",
      "https://bioschemas.org/profiles/Person/0.3-DRAFT has type http://schema.org/CreativeWork\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b178 has type http://schema.org/CreativeWork\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b190 has type http://schema.org/CreativeWork\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b203 has type http://schema.org/CreativeWork\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b234 has type http://schema.org/CreativeWork\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b250 has type http://schema.org/CreativeWork\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b253 has type http://schema.org/CreativeWork\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b261 has type http://schema.org/CreativeWork\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b277 has type http://schema.org/CreativeWork\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b280 has type http://schema.org/CreativeWork\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b345 has type http://schema.org/CreativeWork\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b351 has type http://schema.org/CreativeWork\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b356 has type http://schema.org/CreativeWork\n",
      "https://bio.tools/bwa/op_2/in_2 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bwa/op_3/in_2 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bwa/op_4/in_2 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bwa/op_4/in_3 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bwa/op_5/in_2 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bwa/op_5/in_3 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bwa/op_6/in_2 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/macs/op_1/in_3 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bowtie2/op_1/in_1 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bwa/op_1/in_1 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bwa/op_2/in_1 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bwa/op_3/in_1 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bwa/op_4/in_1 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bwa/op_5/in_1 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/bwa/op_6/in_1 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/fastqc/op_1/in_1 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/macs/op_1/in_1 has type http://bioschemas.org/types/FormalParameter\n",
      "https://bio.tools/macs/op_1/in_2 has type http://bioschemas.org/types/FormalParameter\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b77 has type http://schema.org/ImageObject\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b78 has type http://schema.org/ImageObject\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b79 has type http://schema.org/ImageObject\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b80 has type http://schema.org/ImageObject\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b81 has type http://schema.org/ImageObject\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b82 has type http://schema.org/ImageObject\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b176 has type http://schema.org/ImageObject\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b226 has type http://schema.org/ImageObject\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b259 has type http://schema.org/ImageObject\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b291 has type http://schema.org/ImageObject\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b310 has type http://schema.org/ImageObject\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b342 has type http://schema.org/ImageObject\n",
      "https://www.france-bioinformatique.fr/#/schema/BreadcrumbList has type http://schema.org/BreadcrumbList\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b311 has type http://schema.org/BreadcrumbList\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b319 has type http://schema.org/BreadcrumbList\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b91 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b92 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b93 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b94 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b95 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b96 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b97 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b98 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b99 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b100 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b101 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b102 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b103 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b104 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b105 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b106 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b107 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b108 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b312 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b313 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b314 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b320 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b321 has type http://schema.org/ListItem\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b322 has type http://schema.org/ListItem\n",
      "https://www.france-bioinformatique.fr/#/schema/WebSite has type http://schema.org/WebSite\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b285 has type http://schema.org/WebSite\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b288 has type http://schema.org/WebSite\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b292 has type http://schema.org/WebSite\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b343 has type http://schema.org/WebSite\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b109 has type http://schema.org/SearchAction\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b111 has type http://schema.org/SearchAction\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b113 has type http://schema.org/SearchAction\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b115 has type http://schema.org/SearchAction\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b117 has type http://schema.org/SearchAction\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b119 has type http://schema.org/SearchAction\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b110 has type http://schema.org/EntryPoint\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b112 has type http://schema.org/EntryPoint\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b114 has type http://schema.org/EntryPoint\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b116 has type http://schema.org/EntryPoint\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b118 has type http://schema.org/EntryPoint\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b120 has type http://schema.org/EntryPoint\n",
      "https://www.france-bioinformatique.fr/formation/ebaii-2021-n1/ has type http://schema.org/WebPage\n",
      "https://www.france-bioinformatique.fr/formation/etbii/ has type http://schema.org/WebPage\n",
      "https://www.france-bioinformatique.fr/formation/ebaii-2022-n1/ has type http://schema.org/WebPage\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b159 has type http://schema.org/WebPage\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b209 has type http://schema.org/WebPage\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b257 has type http://schema.org/WebPage\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b284 has type http://schema.org/WebPage\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b289 has type http://schema.org/WebPage\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b293 has type http://schema.org/WebPage\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b325 has type http://schema.org/WebPage\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b363 has type http://schema.org/WebPage\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b121 has type http://schema.org/ReadAction\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b122 has type http://schema.org/ReadAction\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b123 has type http://schema.org/ReadAction\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b124 has type http://schema.org/ReadAction\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b157 has type http://schema.org/ReadAction\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b158 has type http://schema.org/ReadAction\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b129 has type http://schema.org/Place\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b131 has type http://schema.org/Place\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b145 has type http://schema.org/Place\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b147 has type http://schema.org/Place\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b133 has type http://schema.org/Offer\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b135 has type http://schema.org/Offer\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b137 has type http://schema.org/Offer\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b139 has type http://schema.org/Offer\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b149 has type http://schema.org/Offer\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b151 has type http://schema.org/Offer\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b153 has type http://schema.org/Offer\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b155 has type http://schema.org/Offer\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b134 has type http://schema.org/BusinessEntityType\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b136 has type http://schema.org/BusinessEntityType\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b138 has type http://schema.org/BusinessEntityType\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b140 has type http://schema.org/BusinessEntityType\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b150 has type http://schema.org/BusinessEntityType\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b152 has type http://schema.org/BusinessEntityType\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b154 has type http://schema.org/BusinessEntityType\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b156 has type http://schema.org/BusinessEntityType\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b174 has type http://schema.org/PublicationVolume\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b224 has type http://schema.org/PublicationVolume\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b308 has type http://schema.org/PublicationVolume\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b340 has type http://schema.org/PublicationVolume\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b179 has type http://schema.org/EducationalAudience\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b235 has type http://schema.org/EducationalAudience\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b262 has type http://schema.org/EducationalAudience\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b346 has type http://schema.org/EducationalAudience\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b181 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b183 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b185 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b187 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b189 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b192 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b194 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b196 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b198 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b200 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b201 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b206 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b207 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b208 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b237 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b239 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b241 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b243 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b245 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b247 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b249 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b251 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b254 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b255 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b256 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b264 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b266 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b268 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b270 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b272 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b274 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b276 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b278 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b281 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b282 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b283 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b348 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b350 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b353 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b354 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b360 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b361 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b362 has type http://schema.org/project\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b202 has type http://schema.org/Language\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b252 has type http://schema.org/Language\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b279 has type http://schema.org/Language\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b355 has type http://schema.org/Language\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b204 has type http://schema.org/Thing\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b205 has type http://schema.org/Thing\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b357 has type http://schema.org/Thing\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b358 has type http://schema.org/Thing\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b359 has type http://schema.org/Thing\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b223 has type http://schema.org/WebPageElement\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b307 has type http://schema.org/WebPageElement\n"
     ]
    }
   ],
   "source": [
    "# List all types \n",
    "q = \"\"\"\n",
    "SELECT * WHERE {\n",
    "    ?x rdf:type ?t .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "res = kg.query(q)\n",
    "\n",
    "for r in res:\n",
    "    print(f\"{r['x']} has type {r['t']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "https://tess.elixir-europe.org/events/12eme-ecole-de-bioinformatique-aviesan-ifb-inserm has type Event\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b125 has type Event\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b126 has type Event\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b141 has type Event\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b142 has type Event\n"
     ]
    }
   ],
   "source": [
    "# List all types \n",
    "q = \"\"\"\n",
    "PREFIX sc: <http://schema.org/> \n",
    "\n",
    "SELECT * WHERE {\n",
    "    ?x rdf:type sc:Event .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "res = kg.query(q)\n",
    "\n",
    "for r in res:\n",
    "    print(f\"{r['x']} has type Event\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(rdflib.term.URIRef('http://www.w3.org/1999/02/22-rdf-syntax-ns#type'), rdflib.term.URIRef('http://schema.org/Event'))\n",
      "(rdflib.term.URIRef('http://ogp.me/ns#description'), rdflib.term.Literal('<p>La formation s’adresse à des biologistes directement impliqués dans des projets “Next Generation Sequencing” (NGS). Cette édition de l’école aborde les nouveaux enjeux technologiques: elle s’articulera autour de quatres ateliers thématiques en session parallèle (RNA-seq, ChIP-seq/ATAC-seq, variants DNA-seq, single-cell), et inclura une introduction à l’intégration des données, une ouverture aux technologies “long reads”.</p>\\n\\n<p>L’école vise à introduire les concepts et à manipuler les outils informatiques et à en interpréter les résultats. Elle est basée sur une alternance de courtes sessions théoriques et d’ateliers pratiques. Les participants bénéficieront d’un tutorat personnalisé pour élaborer leur plan d’analyse, et effectuer les premières étapes de traitement de leurs propres données ou de celles de leur plateforme.</p>\\n'))\n",
      "(rdflib.term.URIRef('http://ogp.me/ns#image'), rdflib.term.Literal(''))\n",
      "(rdflib.term.URIRef('http://ogp.me/ns#title'), rdflib.term.Literal('12ème Ecole de Bioinformatique AVIESAN-IFB-Inserm'))\n",
      "(rdflib.term.URIRef('http://ogp.me/ns#url'), rdflib.term.Literal('https://tess.elixir-europe.org/events/12eme-ecole-de-bioinformatique-aviesan-ifb-inserm'))\n",
      "(rdflib.term.URIRef('http://purl.org/dc/terms/conformsTo'), rdflib.term.URIRef('https://bioschemas.org/profiles/Event/0.2-DRAFT-2019_06_14'))\n",
      "(rdflib.term.URIRef('http://schema.org/description'), rdflib.term.Literal('La formation s’adresse à des biologistes directement impliqués dans des projets “Next Generation Sequencing” (NGS). Cette édition de l’école aborde les nouveaux enjeux technologiques: elle s’articulera autour de quatres ateliers thématiques en session parallèle (RNA-seq, ChIP-seq/ATAC-seq, variants DNA-seq, single-cell), et inclura une introduction à l’intégration des données, une ouverture aux technologies “long reads”.\\r\\n\\r\\nL’école vise à introduire les concepts et à manipuler les outils informatiques et à en interpréter les résultats. Elle est basée sur une alternance de courtes sessions théoriques et d’ateliers pratiques. Les participants bénéficieront d’un tutorat personnalisé pour élaborer leur plan d’analyse, et effectuer les premières étapes de traitement de leurs propres données ou de celles de leur plateforme.'))\n",
      "(rdflib.term.URIRef('http://schema.org/endDate'), rdflib.term.Literal('2023-11-10 00:00:00 UTC', datatype=rdflib.term.URIRef('http://schema.org/Date')))\n",
      "(rdflib.term.URIRef('http://schema.org/location'), rdflib.term.BNode('n66fbc1fde9dc4768bc50d4d992339b51b9'))\n",
      "(rdflib.term.URIRef('http://schema.org/location'), rdflib.term.BNode('n66fbc1fde9dc4768bc50d4d992339b51b10'))\n",
      "(rdflib.term.URIRef('http://schema.org/maximumAttendeeCapacity'), rdflib.term.Literal('40', datatype=rdflib.term.URIRef('http://www.w3.org/2001/XMLSchema#integer')))\n",
      "(rdflib.term.URIRef('http://schema.org/name'), rdflib.term.Literal('12ème Ecole de Bioinformatique AVIESAN-IFB-Inserm'))\n",
      "(rdflib.term.URIRef('http://schema.org/startDate'), rdflib.term.Literal('2023-11-05 00:00:00 UTC', datatype=rdflib.term.URIRef('http://schema.org/Date')))\n",
      "(rdflib.term.URIRef('http://schema.org/url'), rdflib.term.URIRef('https://github.com/IFB-ElixirFr/EBAII/'))\n"
     ]
    }
   ],
   "source": [
    "# Show all properties and objects associated to a particular node\n",
    "q = \"\"\"\n",
    "PREFIX sc: <http://schema.org/> \n",
    "\n",
    "SELECT * WHERE {\n",
    "    <https://tess.elixir-europe.org/events/12eme-ecole-de-bioinformatique-aviesan-ifb-inserm> ?p ?o .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "res = kg.query(q)\n",
    "\n",
    "for r in res:\n",
    "    print(r)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "12ème Ecole de Bioinformatique AVIESAN-IFB-Inserm is an Event, started at 2023-11-05 00:00:00 UTC\n",
      "Docker and Singularity for Reproducible Research: Getting Started with Containers is an Event, started at None\n",
      "Docker and Singularity for Reproducible Research: Getting Started with Containers is an Event, started at None\n",
      "Docker and Singularity for Reproducible Research: Getting Started with Containers is an Event, started at None\n",
      "Docker and Singularity for Reproducible Research: Getting Started with Containers is an Event, started at None\n"
     ]
    }
   ],
   "source": [
    "# List all types \n",
    "q = \"\"\"\n",
    "PREFIX sc: <http://schema.org/> \n",
    "\n",
    "SELECT DISTINCT * WHERE {\n",
    "    ?x rdf:type sc:Event ;\n",
    "       sc:name ?name .\n",
    "    OPTIONAL {?x sc:startDate ?d} .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "res = kg.query(q)\n",
    "\n",
    "for r in res:\n",
    "    print(f\"{r['name']} is an Event, started at {r['d']}\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Use EDAM to filter KG"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--2024-01-19 17:24:25--  https://edamontology.org/EDAM_1.25.owl\n",
      "Résolution de edamontology.org (edamontology.org)… 129.177.16.242\n",
      "Connexion à edamontology.org (edamontology.org)|129.177.16.242|:443… connecté.\n",
      "requête HTTP transmise, en attente de la réponse… 200 OK\n",
      "Taille : 3239950 (3,1M) [application/rdf+xml]\n",
      "Sauvegarde en : « EDAM_1.25.owl.1 »\n",
      "\n",
      "EDAM_1.25.owl.1     100%[===================>]   3,09M  6,67MB/s    ds 0,5s    \n",
      "\n",
      "2024-01-19 17:24:26 (6,67 MB/s) — « EDAM_1.25.owl.1 » sauvegardé [3239950/3239950]\n",
      "\n"
     ]
    }
   ],
   "source": [
    "!wget https://edamontology.org/EDAM_1.25.owl"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Loaded 39972 triples\n"
     ]
    }
   ],
   "source": [
    "kg.parse(\"EDAM_1.25.owl\")\n",
    "print(f\"Loaded {len(kg)} triples\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Sequencing\n",
      "Imaging\n",
      "Genotyping experiment\n",
      "Microarray experiment\n",
      "PCR experiment\n",
      "Proteomics experiment\n",
      "RNAi experiment\n",
      "Simulation experiment\n",
      "Immunoprecipitation experiment\n",
      "Cytometry\n",
      "Chromosome conformation capture\n",
      "Protein interaction experiment\n"
     ]
    }
   ],
   "source": [
    "# List all direct sub-classes of Sequencing \n",
    "q = \"\"\"\n",
    "SELECT * WHERE {\n",
    "    #?x rdfs:subClassOf <http://edamontology.org/topic_3168> .\n",
    "    ?x rdfs:subClassOf <http://edamontology.org/topic_3361> .\n",
    "    ?x rdfs:label ?class_label\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "res = kg.query(q)\n",
    "\n",
    "for r in res:\n",
    "    print(f\"{r['class_label']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "https://bio.tools/fastqc\n",
      "https://bio.tools/macs\n",
      "https://bio.tools/bowtie2\n",
      "http://edamontology.org/topic_3168\n",
      "http://edamontology.org/topic_3169\n",
      "http://edamontology.org/topic_0622\n"
     ]
    }
   ],
   "source": [
    "# List all Tools associated to a Laboratory Technique OR Omics\n",
    "q = \"\"\"\n",
    "PREFIX sc: <http://schema.org/> \n",
    "\n",
    "SELECT * WHERE {\n",
    "    {\n",
    "        ?x rdfs:subClassOf* <http://edamontology.org/topic_3361> .\n",
    "        ?x rdfs:label ?class_label .\n",
    "    } UNION {\n",
    "        ?x rdfs:subClassOf* <http://edamontology.org/topic_3391> .\n",
    "        ?x rdfs:label ?class_label .\n",
    "    }\n",
    "    \n",
    "    ?tool sc:applicationSubCategory ?x .\n",
    "    ?truc sc:url ?x .\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "res = kg.query(q)\n",
    "\n",
    "for r in res:\n",
    "    print(f\"{r['tool']}\")\n",
    "    \n",
    "for r in res:\n",
    "    print(f\"{r['truc']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "http://edamontology.org/topic_3173 [None] is a http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3697 [None] is a http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_0089 [Ontology and terminology] is a http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_0199 [Genetic variation] is a http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3063 [Medical informatics] is a http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3170 [RNA-Seq] is a http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3673 [Whole genome sequencing] is a http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_0622 [Genomics] is a http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3168 [Sequencing] is a http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3169 [ChIP-seq] is a http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_3174 [Metagenomics] is a http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_0091 [Bioinformatics] is a http://schema.org/DefinedTerm\n",
      "http://edamontology.org/topic_0089 [Ontology and terminology] is a http://www.w3.org/2002/07/owl#Class\n",
      "http://edamontology.org/topic_0091 [Bioinformatics] is a http://www.w3.org/2002/07/owl#Class\n",
      "http://edamontology.org/topic_0199 [Genetic variation] is a http://www.w3.org/2002/07/owl#Class\n",
      "http://edamontology.org/topic_0622 [Genomics] is a http://www.w3.org/2002/07/owl#Class\n",
      "http://edamontology.org/topic_3063 [Medical informatics] is a http://www.w3.org/2002/07/owl#Class\n",
      "http://edamontology.org/topic_3168 [Sequencing] is a http://www.w3.org/2002/07/owl#Class\n",
      "http://edamontology.org/topic_3169 [ChIP-seq] is a http://www.w3.org/2002/07/owl#Class\n",
      "http://edamontology.org/topic_3170 [RNA-Seq] is a http://www.w3.org/2002/07/owl#Class\n",
      "http://edamontology.org/topic_3173 [None] is a http://www.w3.org/2002/07/owl#Class\n",
      "http://edamontology.org/topic_3174 [Metagenomics] is a http://www.w3.org/2002/07/owl#Class\n",
      "http://edamontology.org/topic_3673 [Whole genome sequencing] is a http://www.w3.org/2002/07/owl#Class\n",
      "http://edamontology.org/topic_3697 [None] is a http://www.w3.org/2002/07/owl#Class\n",
      "https://tess.elixir-europe.org/events/12eme-ecole-de-bioinformatique-aviesan-ifb-inserm-ebaii-2023 [12ème école de bioinformatique AVIESAN - IFB - INSERM (EBAII 2023)] is a http://schema.org/Course\n",
      "https://tess.elixir-europe.org/materials/hands-on-for-assembly-of-metagenomic-sequencing-data-tutorial [Hands-on for 'Assembly of metagenomic sequencing data' tutorial] is a http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b177 [Hands-on: Hands-on: Identification of the binding sites of the Estrogen receptor] is a http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b227 [Introduction] is a http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b315 [Introduction] is a http://schema.org/LearningResource\n",
      "n66fbc1fde9dc4768bc50d4d992339b51b344 [Hands-on: Hands-on: Assembly of metagenomic sequencing data] is a http://schema.org/LearningResource\n"
     ]
    }
   ],
   "source": [
    "# List all types of entities annotated with EDAM topics\n",
    "q = \"\"\"\n",
    "PREFIX sc: <http://schema.org/> \n",
    "\n",
    "SELECT DISTINCT ?truc ?name ?t WHERE {\n",
    "    VALUES ?p {sc:url sc:about} .\n",
    "    \n",
    "    ?truc ?p ?x .\n",
    "    FILTER (regex(str(?x),'topic_')) .\n",
    "    ?truc rdf:type ?t \n",
    "    \n",
    "    OPTIONAL {?truc sc:name ?name}\n",
    "}\n",
    "\"\"\"\n",
    "\n",
    "res = kg.query(q)\n",
    "    \n",
    "for r in res:\n",
    "    print(f\"{r['truc']} [{r['name']}] is a {r['t']}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Hands-on\n",
    "\n",
    "Find all persons and their name, if they exist, authors of tools or learning resources, annotated with an EDAM topic"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.13"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
